/obj/structure/fluff/commsbuoy_receiver
	name = "星际接收器"
	desc = "通讯浮标上的碟形组件，用于探测并记录星际信号。"
	icon = 'icons/obj/machines/telecomms.dmi'
	icon_state = "broadcast receiver"

/obj/structure/fluff/commsbuoy_processor
	name = "通讯浮标处理单元"
	desc = "这台机器用于处理并解码星际传输，随后再转发和广播。"
	icon = 'icons/obj/machines/telecomms.dmi'
	icon_state = "processor"

/obj/structure/fluff/commsbuoy_broadcaster
	name = "星际广播器"
	desc = "通讯浮标上的碟形组件，用于广播经过处理的星际信号。"
	icon = 'icons/obj/machines/telecomms.dmi'
	icon_state = "broadcaster"

/obj/structure/fluff/sat_dish
	name = "卫星天线"
	desc = "不知道这地方能不能收到什么体育频道。"
	density = FALSE
	deconstructible = TRUE
	icon = 'icons/obj/fluff/general.dmi'
	icon_state = "sat_dish"

/obj/item/keycard/nt_commsbuoy
	name = "纳米传讯通讯浮标钥匙卡"
	desc = "一张醒目地印着纳米传讯标志的钥匙卡。上一位使用者把末端折断了；卡片仍能刷卡，但现在无法 \
	插入任何芯片读取器。背面大部分被干涸的血迹遮住，印着“顺旋”字样，后面跟着一串无法辨认的 ID 字符。"
	color = "#4c80b1"
	puzzle_id = "nt_commsbuoy"

/obj/machinery/door/puzzle/keycard/nt_commsbuoy
	name = "安全气闸"
	puzzle_id = "nt_commsbuoy"

/area/ruin/space/nt_commsbuoy
	name = "\improper 纳米传讯通讯浮标"
	sound_environment = SOUND_AREA_SMALL_ENCLOSED
	default_gravity = ZERO_GRAVITY
	ambientsounds = list(
		'sound/ambience/engineering/ambisin2.ogg',
		'sound/ambience/misc/signal.ogg',
		'sound/ambience/misc/signal.ogg',
		'sound/ambience/general/ambigen9.ogg',
		'sound/ambience/engineering/ambitech.ogg',
		'sound/ambience/engineering/ambitech2.ogg',
		'sound/ambience/engineering/ambitech3.ogg',
		'sound/ambience/misc/ambimystery.ogg',
		) //same ambience as tcommsat

/obj/item/paper/fluff/ruins/nt_commsbuoy
	color = COLOR_BLUE_GRAY

/obj/item/paper/fluff/ruins/nt_commsbuoy/table_of_contents
	name = "目录：NT-EBCB 7 型"
	desc = "目录页，文字大多已褪色。手册其余部分不在这里。"
	default_raw_text = {"
	<center><h3>纳米传讯轨道外蓝空间通讯浮标操作手册</h3>
	<h5><i>纳米传讯财产。请勿分发。</i></h5></center>
	<hr>
	<h4>目录</h4>
	法律免责声明：第 1-6 页 <br>
	如何签署：保密协议：第 7 页 <br>
	主天线与副天线：第 8-10 页 <br>
	标准操作代码：第 11 页 <br>
	本地网络阵列：第 12-13 页 <br>
	星际中继：第 14-27 页 <br>
	维护保养：第 28-46 页 <br>
	常见错误代码：第 47 页 <br>
	联系纳米传讯技术支持：第 48-54 页 <br>
	<hr>
	<i>（这一页正好沿着目录末尾被撕下……真希望他们把真正的目录留下了。）</i>
	"}

/obj/item/paper/fluff/ruins/nt_commsbuoy/torn_page
	name = "第 33 页：NT-EBCB 7 型"
	desc = "第 33 页，被撕了下来，上面有许多下划线标注。"
	default_raw_text = {"
	<center><h5><i>纳米传讯财产。请勿分发。</i></h5></center>
	<hr>
	……列出任何上述操作代码或错误代码。如果所示错误未 \
	列在手册中，请参阅第 48/54 页，联系纳米传讯技术员以获得直接协助。 <br>
	<center><h4>重新对准卫星天线</hr></center>
	既然你已确定该错误代码属于对准问题，维修将按一份简单的分步清单进行。请务必严格 \
	按照清单操作，因为在天线未对准时可能造成额外损坏。 <br>
	1. 检查通讯浮标外部是否有任何损坏，或天线是否受到撞击的迹象。如发现损坏，请参阅第 43 页的 \
	更换零件小节。 <br>
	2. 进入通讯浮标之前，请取走本手册前部附带的纳米传讯通讯浮标钥匙卡。这张钥匙卡对 \
	维修过程、浮标的运行效率，以及关闭自动防御系统都至关重要。 <br>
	3. 将此卡醒目地佩戴在身上。可以使用官方的纳米传讯颈挂绳或纳米传讯夹式可伸缩挂绳， \
	挂在衣领、胸前口袋或腰间。 <br>
	4. 从指定气闸进入通讯浮标。浮标上没有空气循环系统，因此请随身携带内部供氧设备与太空服，以防 \
	通讯浮标已经失压。 <br>
	5. 进入房间后，务必立即关闭自动防御系统（参阅第 29 页）。 \
	<b>未执行此步骤可能导致受伤甚至死亡。</b> <br>
	6. 前往与未对准天线相对应的终端——主天线控制器（第 8/9 页）位于本地网络阵列（第 12/13 页）之后的房间里， \
	而最靠近气闸的那台将控制副天线（第 10 页）。 <br>
	7. 将纳米传讯通讯浮标钥匙卡插入终端右下方的插槽（参见图 RD-2）。
	<hr>
	（页面背面沾满了血。真可惜，现在你看不到示意图了……）
	"}

/obj/item/paper/fluff/ruins/nt_commsbuoy/inspection
	name = "顺旋-NT-EBCB 检查报告"
	desc = "激活前检查留下的几则笔记。激活后这本不该还留在这里。"
	default_raw_text = {"
	<center><h3>“SS13 中继站”顺旋 NT-EBCB 激活前检查</h3></center>
	<hr>
	好吧，在发射这个新型号之前，只有几点意见供考虑。非常希望你们能审阅并对所列事项采取行动。 <br>
	- 外部机壳上留有空白。纳米传讯徽标和涂装？<u>能不能把这块广告位卖出去？</u> <br>
	- 主天线已证明即使在严重网络负载下也足够用。把一半处理任务分给副天线只会带来 \
	故障风险；副天线不是本就该作为备用吗？为什么我们一直用它？ <br>
	- 星际中继的加密有些过时。在这次更新完成之前，这颗卫星甚至不该<b>离开</b>中央指挥部。 <br>
	- <b>请重新考虑部署位置。</b>SS13 所在的本地区域对于未经测试的通讯设备来说不够安全。结合上面 \
	关于加密的问题，这构成<b>严重的安全风险。</b> <br>
	- 炮塔功能符合预期，只要完整条码没有被遮挡，就能正确读取 ID。但是，请复核：炮塔的 \
	位置。关键控制台就在射线上，而且并不防激光。不，主机箱里放个备用记录仪是不够的。 <br>
	- 一点表扬：每颗卫星都附上一本手册非常好。更好的建议是配一台控制台或类似的东西， \
	让人们没法直接把它从公告板上撕下来。 <br>
	- 我在船上时顺手修好了断路器；它把 2kW 电力导入照明线路，把灯全烧了。简单的接线故障。发射 \
	其他 7 型之前请先修好，以免出现供电问题。 <br>
	- 虽然这不是一颗可居住的卫星，但要是有一台传真机也许会方便些。现在我得确保在返程途中 \
	别把这些笔记弄丢了。
	<hr>
	<center><h5><i>纳米传讯财产。请勿分发。</i></h5></center>
	"}

/obj/machinery/computer/terminal/nt_commsbuoy
	name = "卫星天线操作终端"
	icon_state = MAP_SWITCH("computer", "/obj/machinery/computer/terminal/nt_commsbuoy")
	icon_screen = "comm"
	tguitheme = "ntos"
	upperinfo = "卫星天线操作读数"
	content = list(
		"<b>10/07/2563</b> - 入站数据包稳定性——失败 <br>\
		<i>请重新对准天线！</i><hr>",
		"<b>17/07/2563</b> - 入站数据包稳定性——失败 <br>\
		<i>请重新对准天线！</i><hr>",
		"<b>19/07/2563</b> - 出站数据包稳定性——成功 <hr>",
		"<b>24/07/2563</b> - 入站数据包稳定性——失败 <br>\
		<i>请重新对准天线！</i><hr>",
		"<b>02/08/2563</b> - 入站数据包稳定性——失败 <br>\
		<i>请重新对准天线！</i><hr>",
		"<b>09/08/2563</b> - 入站数据包稳定性——失败 <br>\
		<i>请重新对准天线！</i><hr>",
		"<b>13/08/2563</b> - 副天线报告发生手动对准变更。<br>\
		<i>如果并非有意为之，请检查外部是否有撞击损坏的迹象！</i><hr>",
		"<b>13/08/2563</b> - 出站数据包稳定性——成功 <hr>",
		"<b>14/08/2563</b> - 入站数据包稳定性——成功 <br>\
		<i>正在转发至处理器以恢复信号。</i><br>\
		…… <i>信号已恢复，入站信号已转发出站</i><br>\
		…… 出站数据包稳定性——成功 <hr>",
		"<b>15/08/2563</b> - 出站数据包稳定性——成功 <hr>",
	)

/obj/machinery/computer/terminal/nt_commsbuoy/blackbox
	name = "黑匣子转录终端"
	upperinfo = "黑匣子转录——13/08/2563"
	content = list(
		"<i>注意：本转录由纳米传讯语音转文字系统生成。阅读本转录即表示你同意语音转文字服务 \
		条款，并同意转录中的任何错误或不准确之处在法律上完全由说话者承担。</i><hr>",
		"11:07 - <b>NTSS 瓦卡希鲁号</b><br> \
		对，足够近了。我们正从那个一直出问题的浮标约一千米范围内经过。我们可以改道去看看，我船上有一名 \
		轨道外工程师。<i>见鬼，这家伙已经在找对应的手册了。</i><br>",
		"11:08 - <b>纳米传讯交通管制</b><br> \
		批准，瓦卡希鲁号。请按你 CDTI 上收到的更新航图改道，在另行通知前保持低于亚光速的速度。预计到达时间 27 分钟。 \
		维修期间务必遵守公司所有规定，这些系统极其敏感，任何新的损坏都将由你承担责任。",
		"11:10 - <b>NTSS 瓦卡希鲁号</b><br> \
		正在调整航向，免责声明也已经打印出来了。结束宽带通讯。",
		"<i>11:11 -  <b>NTSS 瓦卡希鲁号 - 本地</b></i><br> \
		行动组到舰桥，重复，行动组到舰桥。<hr>",
		"11:34 - <b>（应答器未激活）</b><br> \
		管制，我这有，呃——有条鱼还是什么东西在啃我的导航阵列，你们能派个队什么的来吗？带张，呃，大网？",
		"11:37 - <b>纳米传讯交通管制</b><br> \
		不行。你的应答器未激活——停止一切操作，一支安保巡逻队正被派往你的位置。",
		"11:37 - <b>（应答器未激活）</b><br> \
		<i>你知道吗，这样也差不多了。</i> 让他们带上一些维修工具。<i>还有一支鱼叉。</i><hr>",
		"<i>11:40 - <b>NTSS 瓦卡希鲁号 - 本地</b></i><br> \
		好——吧，各位，我们到了报告中的浮标位置。纳米传讯交管说他们通过中继收到的一直是乱糟糟的数据，乱得没法转发。 \
		大概只是天线没对准。行动组很快会派出外勤小队，除此之外，你们该干嘛就继续干嘛。",
		"<i>11:47 - <b>身份不明 - 本地</b></i><br> \
		这里是外勤小队呼叫瓦卡希鲁号，请回话。",
		"<i>11:47 - <b>NTSS 瓦卡希鲁号 - 本地</b></i><br> \
		外勤小队，清晰响亮。怎么耽搁了？",
		"<i>11:48 - <b>身份不明 - 本地</b></i><br> \
		对，呃，这张通行卡好像在天线控制器上不管用。它能让炮塔保持安分，也打开了前门，但 \
		控制台对它没反应。我把带来的那页手册也弄丢了……<i>嗯？</i> 等一下——<i>哦，要整个插进去？我觉得——兄弟——兄弟，我知道怎么把卡插进读取器，你就让我——</i>",
		"11:50 - <b>NT-EBCB-7 阵列</b><br> \
		警报。检测到未通过有效身份识别的生命体。启动防御协议。",
		"<i>11:50 - <b>身份不明 - 本地</b></i><br> \
		操——！！把卡从控制台里拔出来！拔出来！我——",
		"11:51 - <b>NT-EBCB-7 阵列</b><br> \
		所有生命体已清除。祝您安全的一天！<hr>",
		"12:07 - <b>NTSS 瓦卡希鲁号</b><br> \
		纳米传讯交管，这里是 NTSS 瓦卡希鲁号。你们，呃……得派一支清理队去那颗卫星。现在把我们的行动报告发给你们。",
	)

/obj/machinery/computer/terminal/nt_commsbuoy/relay
	name = "远程星际中继操作终端"
	upperinfo = "远程星际中继操作读数"
	content = list(
		"<b>19/07/2563</b> - 出站直连 - <br>\
		<i>发件人：totally_not_a_burner@kosmokomm.net</i> <br>\
		<i>收件人：john_doe_a_deer_a_female_deer@kosmokomm.net</i> <br>\
		<br>\
		我跟你说了！他们不监控这个中继。从它发射起我就在星际中继上留了后门。加密过时， \
		很容易窃听。耐心点。<hr>\
		<center><b><i>数据包被标记为可疑。</b> 正在记录以备审查。</i></center><hr>",

		"<b>13/08/2563</b> - 出站直连 - <br>\
		<i>发件人：NT_S13TC_OFFICIAL@NTFIDspinward.nt</i> <br>\
		<i>收件人：wilson_peters@NTFIDspinward.nt</i> <br>\
		<br>\
		你好，<br>\
		你的工单已被标记为已解决，附注如下：<br>\
		“这里是顺旋 13 星区纳米传讯交通管制，特此通知你的工单已解决。中继现在应该 \
		已按预期运行。请重新尝试发送那条消息。如出现其他问题，请开一张新工单。” <br>\
		感谢你的耐心与持续支持。 <br>\
		<center><h5>顺旋计划——由纳米传讯未来与创新部呈献，与纳米传讯 \
		重工业合作。</h5></center><hr>",

		"<b>14/08/2563</b> - 入站转发 - <br>\
		<i>发件人：wilson_peters@NTFIDspinward.nt</i> <br>\
		<i>中继目标：PORT_ELLIS</i> <br>\
		<br>\
		嘿。我想你。希望我们很快能再通一次全息电话。 <br>\
		工作一直很忙。真希望你能在这儿一起经历，但我知道你执意要拿到公民身份。希望盖特威对你不错。 <br>\
		我一直在整理你留给我的那个项目文件夹，就是等离子那些东西。我完全明白你为什么申请调部门了…… <br>\
		<br>\
		撇开研究这个沉重的话题不谈，我取得了不少惊人的突破。其中大部分仍是你笔记的延续， \
		长期摄入等离子——具体来说是 Pudicitite——对人形物种的影响。我真希望这些预测没那么准确。 \
		看来这只能说明你的头脑多么出众……尽管这事如此阴暗。 <br>\
		<br>\
		你那个负责观察的倒霉助手终于死了。持续的中等强度暴露，即便用各种药物治疗， \
		也让杏仁核像我们之前看到的那样严重畸形。此外，它还彻底且不可逆地摧毁了 \
		下丘脑中的每一条神经通路，使受试者径直走向彻底的烧毁。 <br>\
		他们体温调节受损并不是重点，我也没多少机会把它变成重点。安保不得不 \
		先发制人地杀了他们；他们的杏仁核肿胀，布满紫色和白色的条纹（几乎和你鳞片的颜色一样鲜艳）。不管这种损伤 \
		到底是什么，似乎都导致了过度兴奋和对测试的情绪反应放大。 <br>\
		<br>\
		这……是一场完美的风暴。情绪反应失控，再加上被夸大的环境刺激。我已经 \
		尽可能把一些结果上报到最高层，并建议我们推进等离子过滤的改进，尤其是在面罩方面。具体来说 \
		是采矿防毒面具，就像你论文里提到的——更高的气体暴露使他们成为高风险群体。 <br>\
		我这里的同僚已经在调整他们的测试，以把这件事提到中央指挥部的注意范围内，好让其他空间站也能 \
		为改进我们对此的防护做出贡献。 <br>\
		<br>\
		我知道你让我别再给你发消息，尤其是关于这件事——但我觉得，尤其是你，应该知道。你是对的。你 \
		一直都是对的。请你……回我一句。哪怕只是告诉我，*我* 有没有做对什么。 <br>\
		<center><h5>顺旋计划——由纳米传讯未来与创新部呈献，与纳米传讯重工业合作。</h5></center><hr>",

		"<b>15/08/2563</b> - 出站直连 - <br>\
		<i>发件人：totally_not_a_burner@kosmokomm.net</i> <br>\
		<i>收件人：john_doe_a_deer_a_female_deer@kosmokomm.net</i> <br>\
		<br>\
		我是全银河最厉害的黑客。这活儿你得付我三倍价钱，我的天，辛迪加会付我们一大笔钱。其实你至少得给我 \
		一半的利润。不不，超过一半，活都是我干的。 <br>\
		（附带数据文件：WEGOTIT.syndzip）<hr>\
		<center><i><b>数据包被标记为可疑。</b> 开始追踪。</i></center> \
		<h5>来源已追踪。NT-DAP 已派出。<br>\
		目的地已追踪。NT-DAP 已派出。<br>\
		数据文件已扫描并转发至 NT-DAP。<br>\
		<br>\
		文件来源追踪至一处纳米传讯空间站。已启动封锁。<br>\
		安保警戒级别提升至：红星。<br>\
		已派出 NT-DAP。目标：wilson_peters。</h5><hr>",
	)
