/// Paper Fluff Lore
/obj/item/paper/fluff/ruins/dangerous_research/manifest
	name = "ASRC 名单"
	default_raw_text = "<B>替代科学研究中心</B><BR><BR>伊莱亚斯·瓦伦丁博士——首席神秘学者<BR>研究员迈克·R·史密斯——化学家<BR>研究员杰莎·阿姆斯特朗——秘术师<BR>海滩之梦博士——医疗助理<BR>惠特纳·杰伊·格雷汉姆博士——外科医生<BR>布里安娜·西姆斯警官——前哨保卫特工<BR>约翰·多伊——研究志愿者"

/obj/item/paper/fluff/ruins/dangerous_research/head_occultist_note
	name = "狂乱涂写的便条"
	default_raw_text = "约翰最近一直在跟我说话，所以我让格雷汉姆取走了他的舌头。<BR> 他一直在看我，所以医生取走了他的眼睛。<BR>他还是不肯停下说话和凝视。他说，他只想要几样东西。<BR>所有研究都已如此接近成果，让他完成那道符文，会错吗？"

/obj/item/paper/fluff/ruins/dangerous_research/smith
	name = "叛徒的备忘录"
	default_raw_text = "辛迪加在这里搞着某种奇怪的勾当；他们雇了这些人，其中大多数完全不知道自己真正的雇主是谁。<BR>我已经把收集到的数据发给了纳米传讯，我打算明天设法破坏试验，让这一切继续下去是不对的。<BR>他们让病人保持着半清醒状态，所以一些兴奋剂应该能把他弄醒。"
	///Dream-Of-Beaches Journal
/obj/item/paper/fluff/ruins/dangerous_research/beaches_journal_1
	name = "海滩之梦的日志——第 1 天"
	default_raw_text = "嗯，伙食油腻，六个人共用一个卫生间，而且我觉得那位首席神秘学者有点疯，但我终于离开提兹拉了！<BR> 我不太信这些神秘学的鬼话，但报酬不错，而且除了老板，大家都很友善！<BR> 格雷（格瑞？）汉姆博士会和我搭档，一起保障病人的安全。"

/obj/item/paper/fluff/ruins/dangerous_research/beaches_journal_2
	name = "海滩之梦的日志——第 33 天"
	default_raw_text = "有些不对劲。约翰被弄瞎、弄哑已经有一段时间了，但他仍在中央舱室里活动，画着什么东西。伊莱亚斯、史密斯和惠特纳似乎对正在发生的事有所了解，却不肯回答我的问题。<BR>今晚我要溜进实验室，看看那些画。"

/obj/item/paper/fluff/ruins/dangerous_research/beaches_journal_3
	name = "海滩之梦的日志——第 52 天"
	default_raw_text = "史密斯当时在舱室里，一瞬之间就没了。<BR> 我不知道医生和伊莱亚斯出了什么事，我只听到皮肉撕裂和玻璃碎裂的声音。<BR> 等我睁开眼，房间里已染满了红色与锈色。<BR> 西姆斯当时在那儿，但她一闪就消失了，只留下那把枪。<BR> 阿姆斯特朗抓住我，我们不知怎么逃了出来，用大厅里的桌子把门堵上了。<BR> 我们带走了两套太空服，等到了外面就发出求救信号。"
	/// Armstrong Memos
/obj/item/paper/fluff/ruins/dangerous_research/armstrong_memo_1
	name = "杰莎·阿姆斯特朗的笔记——第 18 天"
	default_raw_text = "听说英特戴恩要把我扔到这块石头上时，我并不怎么兴奋，但这个约翰·多伊彻底引起了我的兴趣。<BR>他是我遇到的唯一另一个与漫宿有联系的人，而且他们的联系强得<B>惊人</B>。<BR>我还以为能画出几道生效符文的自己已经是个天生的怪胎了。这名受试者甚至<B>在</B>伊莱亚斯下令做了那么多手术的情况下，仍能达成与漫宿的完美联系。"

/obj/item/paper/fluff/ruins/dangerous_research/armstrong_memo_2
	name = "杰莎·阿姆斯特朗的笔记——第 47 天"
	default_raw_text = "我发誓，伊莱亚斯会把我们全害死。手术越来越频繁，他把受试者推到了远超安全范围的地步。<BR>格雷汉姆是条忠犬，史密斯毫不在乎，而海滩是个懦夫。除了我，没人会去告诉首席，乱动松果体很危险。<BR>据说现在试验进展更快了，但接下来几天我也被锁在自己房间里。他根本不知道自己招惹的是什么。"

/obj/item/paper/fluff/ruins/dangerous_research/armstrong_memo_3
	name = "收容备忘录——安全"
	default_raw_text = "<B>严禁：</B><BR>——未经首席批准，在任何时候让受试者离开其牢房<BR>——长时间待在受试者身边。格雷汉姆博士和我已确认，长期接触会导致头痛、贫血和失眠。<BR>——忘记保持病人的镇静剂供应稳定。确保他们不参与试验时，其静脉滴注（B 型阴性血、生理盐水与吗啡按 3:3:1 配比）始终充足。<BR><BR>伊莱亚斯，病人房间里的收音机要一直开着，玩具也要留在里面。我知道这不合规程，但我们一拿走他就会哭，而我们都得睡觉。"
/// Lore Terminals
/obj/machinery/computer/terminal/dangerous_research/front_desk
	upperinfo = "事件报告——西姆斯警官"
	content = list("<B>第 003 天 - 代码 201</B> -> 100 天任务进行到第三天，格雷汉姆博士和研究员史密斯因为一把活检工具的归属发生了小争执。两人被分开，并受到首席神秘学者的训斥。<BR>\
	<B>第 014 天 - 代码 104</B> -> 又是研究员史密斯的麻烦，他被发现用化学分配器制造劣质兴奋剂。首席神秘学者瓦伦丁似乎对这些相对无害的药物极为不满，已禁止一切兴奋剂生产。<BR>\
	<B>第 022 天 - 代码 ？？？</B> -> 首席和阿姆斯特朗在拌嘴，不知道为了什么，但既然阿姆斯特朗提议的办法能止住那可怕的噪音，我站他们那边。我提到睡眠不足时，首席狠狠瞪了我一眼。<BR>\
	<B>第 034 天 - 代码 109</B> -> 海滩博士似乎在下班时间未经首席神秘学者许可进入限制区域查看研究样本。现已实行宵禁。<BR>\
	<B>第 047 天 - 代码 311</B> -> 研究员阿姆斯特朗……好吧，首席没在看了，伊莱亚斯他妈彻底失控了。除非发生事故，否则我不准进入研究实验室，但你在门厅就能听见尖叫声。所有人都绷紧了神经。杰莎因为抗议什么事被关在房间里，不清楚具体情况。<BR>\
	<B>第 051 天 - 代码 ？？？</B> -> 首席神秘学者又开始举止古怪了，他夜里待在实验室，不吃东西也不睡觉。他一直在给团队讲那些我们离目标有多近的演讲，可我的工资不够让我知道我们到底离什么近。<BR>\
	<B>第 052 天 - 持续事件</B> -> 研究实验室发生爆炸，我现在去看看。我想我听到海滩之梦在尖叫。")

/obj/machinery/computer/terminal/dangerous_research/lab_recording
	upperinfo = "安防摄像头日志——052"
	content = list("这里存有试验期间的存档录像日志，你调出了最后几条记录。<BR>\
	<B>凌晨 03:32</B> —— 一名穿着红白相间实验服的年长人类在实验室里来回踱步，盯着收容区里一道画了一半的符文。他很快就离开了，嘴里自言自语。<BR>\
	<B>凌晨 03:38</B> —— 镜头摇过去，只见符文忽然亮起，病态的绿光短暂照亮了实验室，随后熄灭。<BR>\
	<B>上午 08:29</B> —— 实验室的门打开，先前那名穿红实验服的人和另一个看起来像医生的人走了进来，两人正在深入交谈。第三个穿着橙色实验服的年轻人类走进来，谈话随即停止。研究员们四处走动，很快又有一名人类和一名蜥蜴人加入。<BR>\
	<B>上午 9:03</B> —— 一个消瘦、戴面具的男人被带到实验室中央的符文上。他的束缚被解开，他走向符文，用发光的手指在上面描画。<BR>\
	<B>上午 9:04</B> —— 穿橙色衣服的男人走进牢房，研究团队明显大为震惊。他用注射器给那个消瘦的男人注射了药物。<BR>\
	<B>上午 9:05</B> —— 场面彻底失控，穿橙衣的男人当场死亡，被邪异火焰的长鞭撕成碎片。锈蚀在实验室里蔓延，窸窣作响的生物把穿红实验服的人拖出了镜头。<BR>\
	<B>上午 9:06</B> —— 一名安保警卫进入并拔出武器，但他脚下的地面猛然喷出火焰。镜头之外，一只由手臂构成的野兽撕扯着那个像医生的男人。<BR>\
	<B>上午 9:07</B> —— 剩下的那名科学家抓起蜷缩的蜥蜴人，两人一起离开了实验室。那个消瘦的男人似乎在痛苦中，扭曲镜头的能量折磨着他的身体。传来一声爆炸，摄像头随即黑屏。<BR>\
	<B>可用录像结束</B>")

/obj/machinery/computer/terminal/dangerous_research/greyham_report
	upperinfo = "医疗日志——惠特纳·杰伊·格雷汉姆博士"
	content = list("<B>001 - 轻度</B> 治疗了研究员阿姆斯特朗的轻微纸割伤。<BR>\
	<B>003 - 轻度</B> 用冰袋治疗了格雷汉姆博士和研究员史密斯的轻微瘀伤。<BR>\
	<B>004 - 中度</B> 试验开始，为受试者插入永久性静脉滴注。<BR>\
	<B>006 - 重度</B> 摘除受试者视力。手术切断了受试者的视神经。<BR>\
	<B>007 - 轻度</B> 首席神秘学者瓦伦丁因轻微头痛症状服用扑热息痛。<BR>\
	<B>010 - 重度</B> 摘除受试者视力。手术摘除受试者双眼，视神经已烧灼封闭。<BR>\
	<B>011 - 中度</B> 为全体人员治疗缺铁。首席神秘学者瓦伦丁额外服用了一剂扑热息痛。<BR>\
	<B>015 - 重度</B> 对受试者实施前额叶脑白质切断术。手术期间受试者醒来并盯着医护人员。<BR>\
	<B>015 - 重度</B> 摘除受试者视力。手术摘除受试者双眼，视神经已烧灼封闭。<BR>\
	<B>016 - 中度</B> 为全体人员治疗睡眠不足（苯海拉明，10u）<BR>\
	<B>数据损坏</B><BR>\
	<B>047 - 重度</B> 将神经刺激器植入病人的松果体。<BR>\
	<B>049 - 重度</B>摘除受试者视力。手术摘除受试者双眼，视神经已烧灼封闭。<BR>\
	<B>050 - 重度</B>摘除受试者说话能力。手术摘除受试者舌头，伤口已烧灼封闭。<BR>")

// Lore ID cards
/obj/item/card/id/away/dangerous_research
	name = "迈克·R·史密斯"
	desc = "一张旧 ID 卡，上面贴着写着“研究员”的标签。"
	trim = /datum/id_trim/away/dangerous_research

/obj/item/card/id/away/dangerous_research/head_occultist
	name = "伊莱亚斯·瓦伦丁"
	desc = "一张旧 ID 卡，上面贴着写着“首席神秘学者”的标签。卡片上沾着干涸的血迹。"
	trim = /datum/id_trim/away/dangerous_research/head_occultist
