/// lore papers
/obj/item/paper/fluff/ruins/the_outlet/amos_note
	name = "阿莫斯·罗德里格斯的一封正式投诉"
	default_raw_text = "唉，要是我还得在这儿忍受更多这种愚蠢的破事，我就要疯了。<BR> 卡莱布一直拿我没给顾客应有的尊重这事训我，说实话我一点儿也不在乎，真是的，每次顾客要上厕所，我都得把自己的 ID 卡给他们，因为认证是卡莱布那蠢货亲自搞的。<BR><BR> 这还不算完，顾客总跟我抱怨他们上厕所时老听见墙里有抓挠声，我还以为卡莱布是这儿唯一的疯子呢！<BR><BR> 我看我很快就得递辞呈了，这地方我实在受不了了。"

/obj/item/paper/fluff/ruins/the_outlet/warning_notice
	name = "致收银员的警告"
	default_raw_text = "我注意到有些人管不住自己的手，一直试图进入商品储藏室。<BR> 商品储藏室禁止入内是有原因的，不，不是因为里面藏着一个失落文明的宝藏，也不是因为我和我妻子其实是外星人，被派到你们的小行星殖民地来收割器官。<BR> 我们把所有有机布料和材料都保存在恒定的温度下，以确保我们手工制作的、出售的服装和装束品质如一，我们绝不能冒任何风险，我是说任何风险，让它们暴露在储藏室之外的大气环境中。<BR> 这是第一次也是最后一次警告。从今往后，若有人被发现试图进入商品储藏室，我们将当场解雇，并通知当局以非法入侵罪处理你。"

/obj/item/paper/fluff/ruins/the_outlet/tanners_steps
	name = "完美皮革的配方"
	default_raw_text = "经过多年深入研究，我终于完善了自己的解剖方法，以获得尽可能最高品质的皮革。<BR> 顶级品质，无褶皱、无斑点、无变色，每次都完美无瑕。<BR> 我现在把它记下来，免得以后忘了，步骤如下：<BR><BR> 首先，确保你的对象无法反抗，要么让他们完全镇静，要么切断他们小腿和手腕上的肌肉。这一步非常重要。镇静产出的产品品质稍差，但通常更容易操作。如果你赶时间，就用镇静；否则就直接切断肌肉，因为总体上产出的产品要好得多。<BR><BR> 既然对象已被你今天选定的方法制服，那就拿起你的手术刀，按照下面草图上的标记下手：<BR><BR>*笔记部分满是复杂的外科手术图解和素描，以及蜥蜴人与人类在操作步骤上的差异。纸张散发着淡淡的甲醛和腐臭气味。*"

/obj/item/paper/crumpled/bloody/ruins/the_outlet/concerned_note
	name = "几乎无法辨认的便条"
	default_raw_text = "卡莱布开始真的让我毛骨悚然了。<BR> 他对做出完美衣服的痴迷达到了前所未有的程度，看他最近对我和其他人那副样子，我开始担心他是不是沾上了毒品，或者更糟的东西。<BR> 就在前几天，他冲我的朋友丹妮丝发火，因为她被我们的地毯绊倒，摔了手里的酒杯。我说这没什么大不了，蒸汽清洗一下就好，但卡莱布顿时火冒三丈，还想对她动手！<BR><BR> 我只好扇了他一巴掌，才让他从她身上离开，好让我有机会跟他讲道理。我只希望能和他把这件事解决，我们一起经历过艰难时光，但我还是爱他，爱得你难以想象。<BR><BR> 希望他能听进道理——<BR><BR>*其余部分无法辨认，页面底部被一大片血污和泥土覆盖。*"

/obj/item/paper/crumpled/bloody/ruins/the_outlet/final_regrets
	name = "我最后的告别"
	default_raw_text = "致读到这张便条的人：<BR><BR> 我以我热爱的名义，犯下了无法言说的行径。<BR> 过去 14 年里，我绑架、残害、杀害了那么多人，我恐怕已经给那些不幸遇见我的人造成了无可挽回的伤害。<BR><BR> 请不要把这张便条误解为对我罪行的某种拙劣悔悟，不，我一点也不为自己做过的事感到愧疚。<BR><BR> 我已厌倦日复一日地为我的手艺操劳，所以我要把目光投向更高处；借着这次血肉的献祭，我的灵魂将超越此界，进入几何之神。<BR><BR><BR><strong> 你最好祈祷我找不到我要找的东西。 </strong> <BR><BR>*页面其余部分糊着厚厚一层血。底部排列着印记和无法辨认的文字，但你分辨不出任何具体的含义。*"

// lore ID cards
/obj/item/card/id/away/the_outlet
	name = "阿莫斯·罗德里格斯"
	desc = "一张旧型号的民用 ID 卡，背面印着姓名缩写 \ A.R.\ ，除了布满灰尘之外，看起来崭新如初。"
	trim = /datum/id_trim/away/the_outlet

/obj/item/card/id/away/the_outlet/angry_assistant_manager
	name = "玛丽·惠特克"
	desc = "一张旧型号的民用 ID 卡，背面印着姓名缩写 \ M.W. \ ，卡片散发着淡淡的薰衣草香，磨损得比较厉害。"
	trim = /datum/id_trim/away/the_outlet/angry_assistant_manager

/obj/item/card/id/away/the_outlet/mad_manager
	name = "卡莱布·惠特克"
	desc = "一张旧型号的民用 ID 卡，背面印着姓名缩写 \ C.W. \ ，正面覆着一层薄薄的污垢，似乎还有血迹。"
	trim = /datum/id_trim/away/the_outlet/mad_manager
