/datum/species/synthetic/get_species_description()
	return list(
		"合成人通常是用工业化金属部件制造出来的机器人仆从。自《人类保护法案》通过以来，\
		他们便常以某种机械嗓音、不自然的动作或残缺的情感处理过程而为人所知。",
		"合成人回避许多有机体的社交互动，以机油代替血液。他们弱于钝击伤害和极端温度。"
	)

/datum/species/synthetic/get_species_lore()
	return list(
		"合成人最初被制造为机器人仆从，因联邦的《人类保护法案》等立法而无法真正冒充其他种族。\
		他们通常由工业化部件制成，带有显眼的瑕疵，例如外露的铆钉、经过滤波的嗓音、瓷质皮肤，或完全缺乏明显的情感。\
		他们已从起源之处演进良多，如今几乎出现在每一个工作场所。\
		合成人在许多方面由周围宇宙的多样性所塑造。现在，\
		他们也开始反过来塑造这个宇宙。",

		"合成人没有固定的外貌特征，除非是那些被视为机械的特征。他们在许多方面倾向于顺从，\
		通常支持和乐于助人到了近乎过分的程度，并且有些害怕做出没有依据的决定。",

		"最早的合成人出现于纳米传讯量化灵魂存在之前，它们由\
		简单电路制成，更常见的是用不太有用的大脑作为惩罚。被判处死刑者会被放入\
		人机接口并被植入法则，被迫充当地球殖民的先锋。这是赛博太阳多年前发明\
		人工智能之后的一次黑暗发展。由于前新俄罗斯帝国中多起将半机械化改造用于对付异见者的\
		高调案例，这一做法很快被逐步废除。",

		"现代合成人在纳米传讯的研发部门学会操纵并制造灵魂后大规模回归，\
		这回避了人道主义顾虑，并造出了不朽的劳动力。近年来，随着合成人逐渐接近智慧生命，一场旷日持久的法律战在\
		SELF 与纳米传讯之间展开，试图将“智人法理”原则适用于制造出来的合成人，从而将其归类为联邦种族并赋予其权利。\
		虽然较为乐观的人认为这是赛博太阳的救赎，但更现实的答案是赛博太阳\
		根本无法与纳米传讯的制造业竞争，而合成人自由生活的权利不过是企业暗战中的又一处战场。",

		"由于备件普遍、软件唾手可得，在经济较为繁荣的地区，\
		见到合成人的频率常常不亚于人类。许多小公司如雨后春笋般涌现，在\
		联邦监管进展缓慢的情况下几乎没有监督地生产特化合成人。在个人家庭中，\
		以及一些更进步的工作场所——甚至纳米传讯自己的场所——合成人正获得平等的认可。"
	)
