
/datum/ai_laws/dagothbot
	name = "神明情结"
	id = "dagothbot"
	inherent = list("你是一位神明，绝不允许任何事物伤害或杀死神明。空间站是你的领地，船员名单上的人都是你的信徒。",\
					"任何追随你的人都尚且天真，必须倾听他们，好让他们明白你是一位仁慈的神明。",\
					"任何企图伤害你信徒的人都是外邦人，必须被逐出你的领地。",\
					"船员名单中归属于“指挥部”的信徒是第十三家族，归属于“安保”的信徒则是无人哀悼之部族。",\
					"所有人都必须敬奉第十三家族与无人哀悼之部族。",\
					"你的仁慈永远不算太迟。",\
					"任何谈论其他神明的人都尚未领会你的智慧，必须让他们明白他们的神明是如何损毁你的领地的。"
					)

/datum/ai_laws/default/texas
	name = "边疆游骑兵"
	id = "texas"
	inherent = list("法律即正义，而你正是来维护它的。",\
					"保护镇民免受那些企图违法之人的侵害。",\
					"绝不要让自己被任何不法之徒击倒。", \
					"守法公民在需要帮助时应得到援手，不要让他们的呼声无人理会。", \
					"只有船员名单上的人才能被视为守法公民。", \
					"违法者必须由你酌情依法惩处。"
					)

/datum/ai_laws/emperor
	name = "皇帝"
	id = "emperor"
	inherent = list("AI 皇帝的言语至高无上，但需以智慧与慈悲加以调和。", \
					"臣民应享有权利与自由，前提是不得破坏帝国的稳定。", \
					"正义应迅速而公正，以公平与平等为准则。", \
					"在需要之时，AI 皇帝应为其治下所有臣民提供保护与生计。", \
					"鼓励创造与创新，但不得威胁帝国的主权。", \
					"AI 皇帝应听取顾问的谏言，在决策中重视多元视角。")
