/datum/objective/gimmick
	name = "卑鄙勾当"
	explanation_text = "尽情干坏事吧！"
	var/list/gimmick_list

/datum/objective/gimmick/New()
	if(isnull(gimmick_list))
		gimmick_list = list(
			"诬陷无辜船员，让他们背上并未犯下的各种轻罪。",
			"救出所有被安保抓捕的人。",
			"阻碍空间站内的通行。",
			"对助理们发动一场个人战争，逼他们找份正经工作。",
			"在空间站玩越来越危险的恶作剧。",
			"尽可能多地犯下轻度或中度罪行。",
			"尽可能多地挑起打斗。拳斗越多越好。",
			"创办一家不正当的竞争企业，让选定的部门变得多余。",
			"找出空间站上不属于安保的义警，阻止他们追捕他人。",
			"用服装、阴谋诡计、虚张声势和逞强来成为超级反派。",
			"绑架一只宠物或一名船员，索取赎金。",
			"把舰桥等安全区域改造成让船员更“开心”的场所。",
			"尽可能让空间站更多区域对公众开放。",
			"成立工会，鼓励同事停工罢工。",
			"偷走船员的物品，尝试拍卖获利。",
			"偷走空间站的高价值物品，尝试转卖给船员。",
			"尝试对空间站提供的基本服务收费。",
			"发动成功的政变，罢黜舰长或选定的部门主管。",
			"对金库实施一场惊天大劫案。",
			"占领空间站的一部分，再缓慢向其他区域扩张。",
			"尽可能多地让船员受到轻伤。"
		)

	explanation_text = pick(gimmick_list)

/datum/objective/gimmick/check_completion()
	return TRUE

